## HYPOTHESIS TESTING:LABORATARY DATA
  
### PROBLEM STATMENT: A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. 
### They collected a random sample and recorded TAT for reports of 4 laboratories. 
### TAT is defined as sample collected to report dispatch.
### Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.

### Import libraries

In [2]:
import pandas as pd
from scipy import stats

### Reading the csv file

In [4]:
labtat=pd.read_csv("LabTAT.csv")
labtat.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [5]:
labtat

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

### H0 - There is no difference in average of TAT value among the different laboratories
### H1 - There is a difference in average of TAT value among the different laboratories

In [6]:
stats.f_oneway(labtat.iloc[:,0], labtat.iloc[:,1],labtat.iloc[:,2],labtat.iloc[:,3])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

## Inference:
### P value is 2.1156708949992414e-57 which is less than  0.05. so, we reject the null hypothesis and accepting the alternate hypothesis .
### So,there is a difference in average of TAT value among the different laboratories